crownstone/bluenet/include/cs_nRF51822.h
/**
 * Author: Christopher Mason
 * Author: Anne van Rossum
 * License: TODO
 */
#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#ifndef NULL
#define NULL ((void *)0)
#endif

#include <stdint.h>

// This in some sense replicates the Nordic SDK headers.  I wanted something that
// wasn't covered by their license, and that used plain offsets instead of structs.

// To format register tables from reference manual,
// for instance: PORT 0x17C Event generate from multiple input pins.
// Replace ^([^/ #\n\r]+) (\S+) (.*)
// With    #define FOO_\1                *(volatile uint32_t*) (FOO + \2)          //\3
// Where FOO is name of peripheral

// For registers with brackets,
// for instance: CONFIG[0] 0x510 Configuration for OUT[0] task and IN[0] event.
// Replace ^([^/ #\n\r]+)\[(\d+)\] (\S+) (.*)
// With    #define NRF51_GPIOTE_$1_$2                *(volatile uint32_t*) (NRF51_GPIOTE + $3)          // $4

// Todo: reorder this document
//   POWER    
//   CLOCK                   0x40000000                    Clock control
//   RADIO                   0x40001000                    2.4 GHz radio
//   UART                    0x40002000                    UART
//   SPI0                    0x40003000                    First SPI
//   TWI0                    0x40003000                    First TWI (I2C compatible)
//   SPI1                    0x40004000                    Second SPI
//   TWI1                    0x40004000                    Second TWI (I2C compatible)
//   GPIOTE                  0x40006000                    GPIO tasks and events
//   ADC                     0x40007000                    Analog-Digital converter
//   TIMER0                  0x40008000                    High-frequency timer
//   TIMER1                  0x40009000
//   TIMER2                  0x4000A000
//   RTC0                    0x4000B000                    Low-frequency counter (real-time counter)
//   TEMP                    0x4000C000                    Temperature sensor
//   RNG                     0x4000D000                    Random number generator
//   ECB                     0x4000E000                    Crypto electronic codebook
//   CCM                     0x4000F000                    AES
//   AAR                     0x4000F000                    Accelerated address resolver
//   WDT                     0x40010000                    Watchdog timer
//   RTC1                    0x40011000                    Low-frequency counter (real-time counter)
//   QDEC                    0x40012000                    Quadrature decoder
//   NVMC                    0x4001E000                    Non-volatile memory controller
//   PPI                     0x4001F000                    Programmable peripheral interconnect (not Blackfin PPI)
//   GPIO                    0x50000000                    GPIO
//
// All these peripherals can be accessed through the standard ARM Cortex Advanced Peripheral Bus (APB) and the AMBA 
// High-performance (AHB) registers. And they can be accessed through task, event, and interrupt registers.
//
// Tasks are used to indicate functionality within a peripheral. Each task in a peripheral has a separate register.
// Events indicate information to be exchanged between the CPU and the peripherals, for example, some state change.
// A shortcut connects a task with an event.

////////////////////////////////////////////////////////////////////////////////////////////////////
/// NRF51_POWER //////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////

//TASKS
// Anne: is this correct? Shouldn't NRF51_POWER be equal to 0x40000000 ?
#define NRF51_POWER                    (volatile uint8_t*) 0x4000B000
//#define NRF51_POWER                    (volatile uint8_t*) 0x40000000
#define NRF51_POWER_CONSTLAT           *(volatile uint32_t*) (NRF51_POWER + 0x078)          //Enable constant latency mode
#define NRF51_POWER_LOWPWR             *(volatile uint32_t*) (NRF51_POWER + 0x07C)          //Enable low power mode (variable latency)
//EVENTS
#define NRF51_POWER_POFWARN            *(volatile uint32_t*) (NRF51_POWER + 0x108)          //Power failure warning
//REGISTERS
#define NRF51_POWER_INTENSET           *(volatile uint32_t*) (NRF51_POWER + 0x304)          //Interrupt enable set register
#define NRF51_POWER_INTENCLR           *(volatile uint32_t*) (NRF51_POWER + 0x308)          //Interrupt enable clear register
#define NRF51_POWER_RESETREAS          *(volatile uint32_t*) (NRF51_POWER + 0x400)          //Reset reason
#define NRF51_POWER_SYSTEMOFF          *(volatile uint32_t*) (NRF51_POWER + 0x500)          //System off register
#define NRF51_POWER_POFCON             *(volatile uint32_t*) (NRF51_POWER + 0x510)          //Power failure configuration
#define NRF51_POWER_GPREGRET           *(volatile uint32_t*) (NRF51_POWER + 0x51C)          //General purpose retention register
#define NRF51_POWER_RAMON              *(volatile uint32_t*) (NRF51_POWER + 0x524)          //RAM on/off
#define NRF51_POWER_RESET              *(volatile uint32_t*) (NRF51_POWER + 0x544)          //Configure reset functionality
#define NRF51_POWER_DCDCEN             *(volatile uint32_t*) (NRF51_POWER + 0x578)          //DCDC enable register

////////////////////////////////////////////////////////////////////////////////////////////////////
/// CLOCK //////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////

//TASKS
#define NRF51_CLOCK                     (volatile uint8_t*) 0x40000000
#define NRF51_CLOCK_HFCLKSTART          *(volatile uint32_t*) (NRF51_CLOCK + 0x000)          //Start HFCLK crystal oscillator
#define NRF51_CLOCK_HFCLKSTOP           *(volatile uint32_t*) (NRF51_CLOCK + 0x004)          //Stop HFCLK crystal oscillator
#define NRF51_CLOCK_LFCLKSTART          *(volatile uint32_t*) (NRF51_CLOCK + 0x008)          //Start LFCLK source
#define NRF51_CLOCK_LFCLKSTOP           *(volatile uint32_t*) (NRF51_CLOCK + 0x00C)          //Stop LFCLK source
#define NRF51_CLOCK_CAL                 *(volatile uint32_t*) (NRF51_CLOCK + 0x010)          //Start calibration of LFCLK RC oscillator
#define NRF51_CLOCK_CTSTART             *(volatile uint32_t*) (NRF51_CLOCK + 0x014)          //Start calibration timer
#define NRF51_CLOCK_CTSTOP              *(volatile uint32_t*) (NRF51_CLOCK + 0x018)          //Stop calibration timer
// Here there are 57 unsigned integers "reserved"

//EVENTS
#define NRF51_CLOCK_HFCLKSTARTED        *(volatile uint32_t*) (NRF51_CLOCK + 0x100)          //16 MHz oscillator started
#define NRF51_CLOCK_LFCLKSTARTED        *(volatile uint32_t*) (NRF51_CLOCK + 0x104)          //32 kHz oscillator started
#define NRF51_CLOCK_DONE                *(volatile uint32_t*) (NRF51_CLOCK + 0x10C)          //Calibration of LFCLK RC oscillator complete event
#define NRF51_CLOCK_CTTO                *(volatile uint32_t*) (NRF51_CLOCK + 0x110)          //Calibration timer timeout
//REGISTERS
#define NRF51_CLOCK_INTENSET            *(volatile uint32_t*) (NRF51_CLOCK + 0x304)          //Interrupt enable set register
#define NRF51_CLOCK_INTENCLR            *(volatile uint32_t*) (NRF51_CLOCK + 0x308)          //Interrupt enable clear register
#define NRF51_CLOCK_HFCLKSTAT           *(volatile uint32_t*) (NRF51_CLOCK + 0x40C)          //Which HFCLK source is running
#define NRF51_CLOCK_LFCLKSTAT           *(volatile uint32_t*) (NRF51_CLOCK + 0x418)          //Which LFCLK source is running
#define NRF51_CLOCK_LFCLKSRC            *(volatile uint32_t*) (NRF51_CLOCK + 0x518)          //Clock source for the 32 kHz clock
#define NRF51_CLOCK_LFCLKSRC_RC         0                                                    //32.768 kHz RC oscillator
#define NRF51_CLOCK_LFCLKSRC_XTAL       1                                                    //32.768 kHz crystal oscillator
#define NRF51_CLOCK_LFCLKSRC_SYNTH      2                                                    //32.768 kHz synthesizer synthesizing 32.768 kHz from 16 MHz system clock
#define NRF51_CLOCK_CTIV                *(volatile uint32_t*) (NRF51_CLOCK + 0x538)          //Calibration timer interval
#define NRF51_CLOCK_XTALFREQ            *(volatile uint32_t*) (NRF51_CLOCK + 0x550)          //Crystal frequency - DOES NOT WORK - see PAN 028 "12. HFCLK: XTALFREQ register is not functional"


////////////////////////////////////////////////////////////////////////////////////////////////////
/// TIMERS //////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////

