crownstone/bluenet/include/cs_nRF51822.h
// Note: TIMER0 is blocked by the softdevice when the latter is enabled.


// TASKS
#define NRF51_TIMER0                     (volatile uint8_t*) 0x40008000
#define NRF51_TIMER0_IRQn                8
#define NRF51_TIMER0_START               *(volatile uint32_t*) (NRF51_TIMER0 + 0x000)       //Start Timer
#define NRF51_TIMER0_STOP                *(volatile uint32_t*) (NRF51_TIMER0 + 0x004)       //Stop Timer
#define NRF51_TIMER0_COUNT               *(volatile uint32_t*) (NRF51_TIMER0 + 0x008)       //Increment Timer (Counter mode only)
#define NRF51_TIMER0_CLEAR               *(volatile uint32_t*) (NRF51_TIMER0 + 0x00C)       //Clear timer
#define NRF51_TIMER0_CAPTURE_0           *(volatile uint32_t*) (NRF51_TIMER0 + 0x040)       //Capture Timer value to CC0 register
#define NRF51_TIMER0_CAPTURE_1           *(volatile uint32_t*) (NRF51_TIMER0 + 0x044)       //Capture Timer value to CC1 register
#define NRF51_TIMER0_CAPTURE_2           *(volatile uint32_t*) (NRF51_TIMER0 + 0x048)       //Capture Timer value to CC2 register
#define NRF51_TIMER0_CAPTURE_3           *(volatile uint32_t*) (NRF51_TIMER0 + 0x04C)       //Capture Timer value to CC3 register
//EVENTS
#define NRF51_TIMER0_COMPARE_0           *(volatile uint32_t*) (NRF51_TIMER0 + 0x140)       //Compare event on CC[0] match
#define NRF51_TIMER0_COMPARE_1           *(volatile uint32_t*) (NRF51_TIMER0 + 0x144)       //Compare event on CC[1] match
#define NRF51_TIMER0_COMPARE_2           *(volatile uint32_t*) (NRF51_TIMER0 + 0x148)       //Compare event on CC[2] match
#define NRF51_TIMER0_COMPARE_3           *(volatile uint32_t*) (NRF51_TIMER0 + 0x14C)       //Compare event on CC[3] match
//REGISTERS
#define NRF51_TIMER0_SHORTS              *(volatile uint32_t*) (NRF51_TIMER0 + 0x200)       //Shortcuts
#define NRF51_TIMER0_INTENSET            *(volatile uint32_t*) (NRF51_TIMER0 + 0x304)       //Write-only - configures which events generate a Timer interrupt
#define NRF51_TIMER0_INTENCLR            *(volatile uint32_t*) (NRF51_TIMER0 + 0x308)       //Write-only - configures which events do not generate a Timer interrupt
#define NRF51_TIMER0_MODE                *(volatile uint32_t*) (NRF51_TIMER0 + 0x504)       //Timer mode selection
#define NRF51_TIMER0_MODE_TIMER          0
#define NRF51_TIMER0_MODE_COUNTER        1
#define NRF51_TIMER0_BITMODE             *(volatile uint32_t*) (NRF51_TIMER0 + 0x508)       //Configure the number of bits used by the TIMER
#define NRF51_TIMER0_BITMODE_16_BIT      0
#define NRF51_TIMER0_BITMODE_8_BIT       1
#define NRF51_TIMER0_BITMODE_24_BIT      2
#define NRF51_TIMER0_BITMODE_32_BIT      3
#define NRF51_TIMER0_PRESCALER           *(volatile uint32_t*) (NRF51_TIMER0 + 0x510)       //Timer prescaler register
#define NRF51_TIMER0_CC_0                *(volatile uint32_t*) (NRF51_TIMER0 + 0x540)       //Capture/Compare register 0
#define NRF51_TIMER0_CC_1                *(volatile uint32_t*) (NRF51_TIMER0 + 0x544)       //Capture/Compare register 1
#define NRF51_TIMER0_CC_2                *(volatile uint32_t*) (NRF51_TIMER0 + 0x548)       //Capture/Compare register 2
#define NRF51_TIMER0_CC_3                *(volatile uint32_t*) (NRF51_TIMER0 + 0x54C)       //Capture/Compare register 3


// TASKS
#define NRF51_TIMER1                     (volatile uint8_t*) 0x40009000
#define NRF51_TIMER1_IRQn                9
#define NRF51_TIMER1_START               *(volatile uint32_t*) (NRF51_TIMER1 + 0x000)       //Start Timer
#define NRF51_TIMER1_STOP                *(volatile uint32_t*) (NRF51_TIMER1 + 0x004)       //Stop Timer
#define NRF51_TIMER1_COUNT               *(volatile uint32_t*) (NRF51_TIMER1 + 0x008)       //Increment Timer (Counter mode only)
#define NRF51_TIMER1_CLEAR               *(volatile uint32_t*) (NRF51_TIMER1 + 0x00C)       //Clear timer
#define NRF51_TIMER1_CAPTURE_0           *(volatile uint32_t*) (NRF51_TIMER1 + 0x040)       //Capture Timer value to CC0 register
#define NRF51_TIMER1_CAPTURE_1           *(volatile uint32_t*) (NRF51_TIMER1 + 0x044)       //Capture Timer value to CC1 register
#define NRF51_TIMER1_CAPTURE_2           *(volatile uint32_t*) (NRF51_TIMER1 + 0x048)       //Capture Timer value to CC2 register
#define NRF51_TIMER1_CAPTURE_3           *(volatile uint32_t*) (NRF51_TIMER1 + 0x04C)       //Capture Timer value to CC3 register
//EVENTS
#define NRF51_TIMER1_COMPARE_0           *(volatile uint32_t*) (NRF51_TIMER1 + 0x140)       //Compare event on CC[0] match
#define NRF51_TIMER1_COMPARE_1           *(volatile uint32_t*) (NRF51_TIMER1 + 0x144)       //Compare event on CC[1] match
#define NRF51_TIMER1_COMPARE_2           *(volatile uint32_t*) (NRF51_TIMER1 + 0x148)       //Compare event on CC[2] match
#define NRF51_TIMER1_COMPARE_3           *(volatile uint32_t*) (NRF51_TIMER1 + 0x14C)       //Compare event on CC[3] match
#define NRF51_EVENT_INTERRUPT_N(perif, event) (1<<(((((uint32_t)&event) - ((uint32_t)perif)) - 0x100) >> 2))
//REGISTERS
#define NRF51_TIMER1_SHORTS              *(volatile uint32_t*) (NRF51_TIMER1 + 0x200)       //Shortcuts
#define NRF51_TIMER1_INTENSET            *(volatile uint32_t*) (NRF51_TIMER1 + 0x304)       //Write-only - configures which events generate a Timer interrupt
#define NRF51_TIMER1_INTENCLR            *(volatile uint32_t*) (NRF51_TIMER1 + 0x308)       //Write-only - configures which events do not generate a Timer interrupt
#define NRF51_TIMER1_MODE                *(volatile uint32_t*) (NRF51_TIMER1 + 0x504)       //Timer mode selection, either TIMER, or COUNTER
#define NRF51_TIMER1_MODE_TIMER          0
#define NRF51_TIMER1_MODE_COUNTER        1
#define NRF51_TIMER1_BITMODE             *(volatile uint16_t*) (NRF51_TIMER1 + 0x508)       //Configure the number of bits used by the TIMER
#define NRF51_TIMER1_BITMODE_16_BIT      0
#define NRF51_TIMER1_BITMODE_8_BIT       1
#define NRF51_TIMER1_BITMODE_24_BIT      2
#define NRF51_TIMER1_BITMODE_32_BIT      3
#define NRF51_TIMER1_PRESCALER           *(volatile uint32_t*) (NRF51_TIMER1 + 0x510)       //Timer prescaler register
#define NRF51_TIMER1_CC_0                *(volatile uint32_t*) (NRF51_TIMER1 + 0x540)       //Capture/Compare register 0
#define NRF51_TIMER1_CC_1                *(volatile uint32_t*) (NRF51_TIMER1 + 0x544)       //Capture/Compare register 1
#define NRF51_TIMER1_CC_2                *(volatile uint32_t*) (NRF51_TIMER1 + 0x548)       //Capture/Compare register 2
#define NRF51_TIMER1_CC_3                *(volatile uint32_t*) (NRF51_TIMER1 + 0x54C)       //Capture/Compare register 3

#define NRF51_TIMER_SHORTS_COMPARE0_CLEAR (1 << 0)
#define NRF51_TIMER_SHORTS_COMPARE1_CLEAR (1 << 1)
#define NRF51_TIMER_SHORTS_COMPARE2_CLEAR (1 << 2)
#define NRF51_TIMER_SHORTS_COMPARE3_CLEAR (1 << 3)
#define NRF51_TIMER_SHORTS_COMPARE0_STOP  (1 << 8)
#define NRF51_TIMER_SHORTS_COMPARE1_STOP  (1 << 9)
#define NRF51_TIMER_SHORTS_COMPARE2_STOP  (1 << 10)
#define NRF51_TIMER_SHORTS_COMPARE3_STOP  (1 << 11)

// TASKS
#define NRF51_TIMER2                     (volatile uint8_t*) 0x4000A000
#define NRF51_TIMER2_IRQn                10
#define NRF51_TIMER2_START               *(volatile uint32_t*) (NRF51_TIMER2 + 0x000)       //Start Timer
#define NRF51_TIMER2_STOP                *(volatile uint32_t*) (NRF51_TIMER2 + 0x004)       //Stop Timer
#define NRF51_TIMER2_COUNT               *(volatile uint32_t*) (NRF51_TIMER2 + 0x008)       //Increment Timer (Counter mode only)
#define NRF51_TIMER2_CLEAR               *(volatile uint32_t*) (NRF51_TIMER2 + 0x00C)       //Clear timer
#define NRF51_TIMER2_CAPTURE_0           *(volatile uint32_t*) (NRF51_TIMER2 + 0x040)       //Capture Timer value to CC0 register
#define NRF51_TIMER2_CAPTURE_1           *(volatile uint32_t*) (NRF51_TIMER2 + 0x044)       //Capture Timer value to CC1 register
#define NRF51_TIMER2_CAPTURE_2           *(volatile uint32_t*) (NRF51_TIMER2 + 0x048)       //Capture Timer value to CC2 register
#define NRF51_TIMER2_CAPTURE_3           *(volatile uint32_t*) (NRF51_TIMER2 + 0x04C)       //Capture Timer value to CC3 register
//EVENTS
#define NRF51_TIMER2_COMPARE_0           *(volatile uint32_t*) (NRF51_TIMER2 + 0x140)       //Compare event on CC[0] match
#define NRF51_TIMER2_COMPARE_1           *(volatile uint32_t*) (NRF51_TIMER2 + 0x144)       //Compare event on CC[1] match
#define NRF51_TIMER2_COMPARE_2           *(volatile uint32_t*) (NRF51_TIMER2 + 0x148)       //Compare event on CC[2] match
#define NRF51_TIMER2_COMPARE_3           *(volatile uint32_t*) (NRF51_TIMER2 + 0x14C)       //Compare event on CC[3] match
//REGISTERS
#define NRF51_TIMER2_SHORTS              *(volatile uint32_t*) (NRF51_TIMER2 + 0x200)       //Shortcuts
#define NRF51_TIMER2_INTENSET            *(volatile uint32_t*) (NRF51_TIMER2 + 0x304)       //Write-only - configures which events generate a Timer interrupt
#define NRF51_TIMER2_INTENCLR            *(volatile uint32_t*) (NRF51_TIMER2 + 0x308)       //Write-only - configures which events do not generate a Timer interrupt
#define NRF51_TIMER2_MODE                *(volatile uint32_t*) (NRF51_TIMER2 + 0x504)       //Timer mode selection
#define NRF51_TIMER2_MODE_TIMER          0
#define NRF51_TIMER2_MODE_COUNTER        1
#define NRF51_TIMER2_BITMODE             *(volatile uint32_t*) (NRF51_TIMER2 + 0x508)       //Configure the number of bits used by the TIMER
#define NRF51_TIMER2_BITMODE_16_BIT      0
#define NRF51_TIMER2_BITMODE_8_BIT       1
#define NRF51_TIMER2_BITMODE_24_BIT      2
#define NRF51_TIMER2_BITMODE_32_BIT      3
#define NRF51_TIMER2_PRESCALER           *(volatile uint32_t*) (NRF51_TIMER2 + 0x510)       //Timer prescaler register, [0-9]
#define NRF51_TIMER2_CC_0                *(volatile uint32_t*) (NRF51_TIMER2 + 0x540)       //Capture/Compare register 0
#define NRF51_TIMER2_CC_1                *(volatile uint32_t*) (NRF51_TIMER2 + 0x544)       //Capture/Compare register 1
#define NRF51_TIMER2_CC_2                *(volatile uint32_t*) (NRF51_TIMER2 + 0x548)       //Capture/Compare register 2
#define NRF51_TIMER2_CC_3                *(volatile uint32_t*) (NRF51_TIMER2 + 0x54C)       //Capture/Compare register 3


////////////////////////////////////////////////////////////////////////////////////////////////////
/// RTC ////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////


// Note RTC0 is used by softdevice when the latter is enabled.
// TASKS
#define NRF51_RTC0                      (volatile uint8_t*) 0x4000B000
#define NRF51_RTC0_IRQn                 11
#define NRF51_RTC0_START                *(volatile uint32_t*) (NRF51_RTC0 + 0x000)          //Start RTC COUNTER
#define NRF51_RTC0_STOP                 *(volatile uint32_t*) (NRF51_RTC0 + 0x004)          //Stop RTC COUNTER
#define NRF51_RTC0_CLEAR                *(volatile uint32_t*) (NRF51_RTC0 + 0x008)          //Clear RTC COUNTER
#define NRF51_RTC0_TRIGOVRFLW           *(volatile uint32_t*) (NRF51_RTC0 + 0x00C)          //Set COUNTER to 0xFFFFF0
// EVENTS
#define NRF51_RTC0_TICK                 *(volatile uint32_t*) (NRF51_RTC0 + 0x100)          //Event on COUNTER increment
#define NRF51_RTC0_OVRFLW               *(volatile uint32_t*) (NRF51_RTC0 + 0x104)          //Event on COUNTER overflow
#define NRF51_RTC0_COMPARE_0            *(volatile uint32_t*) (NRF51_RTC0 + 0x140)          //Compare event on CC[0] match
#define NRF51_RTC0_COMPARE_1            *(volatile uint32_t*) (NRF51_RTC0 + 0x144)          //Compare event on CC[1] match
#define NRF51_RTC0_COMPARE_2            *(volatile uint32_t*) (NRF51_RTC0 + 0x148)          //Compare event on CC[2] match
#define NRF51_RTC0_COMPARE_3            *(volatile uint32_t*) (NRF51_RTC0 + 0x14C)          //Compare event on CC[3] match
// REGISTERS
#define NRF51_RTC0_INTENSET             *(volatile uint32_t*) (NRF51_RTC0 + 0x304)          //Configures which events shall generate a RTC interrupt
#define NRF51_RTC0_INTENCLR             *(volatile uint32_t*) (NRF51_RTC0 + 0x308)          //Configures which events shall not generate a RTC interrupt
#define NRF51_RTC0_EVTEN                *(volatile uint32_t*) (NRF51_RTC0 + 0x340)          //Configures event enable state for each RTC event
#define NRF51_RTC0_EVTEN_TICK           1
#define NRF51_RTC0_EVTEN_OVERFLOW       2
#define NRF51_RTC0_EVTEN_COMPAREN(n)    (16+n)
#define NRF51_RTC0_EVTEN_COMPARE0       NRF51_RTC0_EVTEN_COMPAREN(0)
#define NRF51_RTC0_EVTEN_COMPARE1       NRF51_RTC0_EVTEN_COMPAREN(1)
#define NRF51_RTC0_EVTEN_COMPARE2       NRF51_RTC0_EVTEN_COMPAREN(2)
#define NRF51_RTC0_EVTEN_COMPARE3       NRF51_RTC0_EVTEN_COMPAREN(3)
#define NRF51_RTC0_EVTENSET             *(volatile uint32_t*) (NRF51_RTC0 + 0x344)          //Enable event(s). Read of this register gives the value of EVTEN.
#define NRF51_RTC0_EVTENCLR             *(volatile uint32_t*) (NRF51_RTC0 + 0x348)          //Disable event(s). Read of this register gives the value of EVTEN.
#define NRF51_RTC0_COUNTER              *(volatile uint32_t*) (NRF51_RTC0 + 0x504)          //Current COUNTER value
#define NRF51_RTC0_PRESCALER            *(volatile uint32_t*) (NRF51_RTC0 + 0x508)          //12-bit prescaler for COUNTER frequency (32768/(PRESCALER+1)) Must be written when RTC is stopped
#define NRF51_RTC0_CC_0                 *(volatile uint32_t*) (NRF51_RTC0 + 0x540)          //Compare register
#define NRF51_RTC0_CC_1                 *(volatile uint32_t*) (NRF51_RTC0 + 0x544)          //Compare register

// TASKS
#define NRF51_RTC1                      (volatile uint8_t*) 0x40011000
#define NRF51_RTC1_IRQn                 17
#define NRF51_RTC1_START                *(volatile uint32_t*) (NRF51_RTC1 + 0x000)          //Start RTC COUNTER
#define NRF51_RTC1_STOP                 *(volatile uint32_t*) (NRF51_RTC1 + 0x004)          //Stop RTC COUNTER
#define NRF51_RTC1_CLEAR                *(volatile uint32_t*) (NRF51_RTC1 + 0x008)          //Clear RTC COUNTER
#define NRF51_RTC1_TRIGOVRFLW           *(volatile uint32_t*) (NRF51_RTC1 + 0x00C)          //Set COUNTER to 0xFFFFF0
// EVENTS
#define NRF51_RTC1_TICK                 *(volatile uint32_t*) (NRF51_RTC1 + 0x100)          //Event on COUNTER increment
#define NRF51_RTC1_OVRFLW               *(volatile uint32_t*) (NRF51_RTC1 + 0x104)          //Event on COUNTER overflow
#define NRF51_RTC1_COMPARE_0            *(volatile uint32_t*) (NRF51_RTC1 + 0x140)          //Compare event on CC[0] match
#define NRF51_RTC1_COMPARE_1            *(volatile uint32_t*) (NRF51_RTC1 + 0x144)          //Compare event on CC[1] match
#define NRF51_RTC1_COMPARE_2            *(volatile uint32_t*) (NRF51_RTC1 + 0x148)          //Compare event on CC[2] match
#define NRF51_RTC1_COMPARE_3            *(volatile uint32_t*) (NRF51_RTC1 + 0x14C)          //Compare event on CC[3] match
// REGISTERS
#define NRF51_RTC1_INTENSET             *(volatile uint32_t*) (NRF51_RTC1 + 0x304)          //Configures which events shall generate a RTC interrupt
#define NRF51_RTC1_INTENCLR             *(volatile uint32_t*) (NRF51_RTC1 + 0x308)          //Configures which events shall not generate a RTC interrupt
#define NRF51_RTC1_EVTEN                *(volatile uint32_t*) (NRF51_RTC1 + 0x340)          //Configures event enable state for each RTC event
#define NRF51_RTC1_EVTEN_TICK           1
#define NRF51_RTC1_EVTEN_OVERFLOW       2
#define NRF51_RTC1_EVTEN_COMPAREN(n)    (1<<(16+n))
#define NRF51_RTC1_EVTEN_COMPARE0       NRF51_RTC1_EVTEN_COMPAREN(0)
#define NRF51_RTC1_EVTEN_COMPARE1       NRF51_RTC1_EVTEN_COMPAREN(1)
#define NRF51_RTC1_EVTEN_COMPARE2       NRF51_RTC1_EVTEN_COMPAREN(2)
#define NRF51_RTC1_EVTEN_COMPARE3       NRF51_RTC1_EVTEN_COMPAREN(3)
#define NRF51_RTC1_EVTENSET             *(volatile uint32_t*) (NRF51_RTC1 + 0x344)          //Enable event(s). Read of this register gives the value of EVTEN.
#define NRF51_RTC1_EVTENCLR             *(volatile uint32_t*) (NRF51_RTC1 + 0x348)          //Disable event(s). Read of this register gives the value of EVTEN.
#define NRF51_RTC1_COUNTER              *(volatile uint32_t*) (NRF51_RTC1 + 0x504)          //Current COUNTER value
#define NRF51_RTC1_COUNTER_MAX          (1<<24)                                             //Max COUNTER value
#define NRF51_RTC1_PRESCALER            *(volatile uint32_t*) (NRF51_RTC1 + 0x508)          //12-bit prescaler for COUNTER frequency (32768/(PRESCALER+1)) Must be written when RTC is stopped
#define NRF51_RTC1_CC_0                 *(volatile uint32_t*) (NRF51_RTC1 + 0x540)          //Compare register
#define NRF51_RTC1_CC_1                 *(volatile uint32_t*) (NRF51_RTC1 + 0x544)          //Compare register


////////////////////////////////////////////////////////////////////////////////////////////////////
/// General Purpose Input Output (GPIO) ////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////

