crownstone/bluenet/include/cs_nRF51822.h
#define NRF51_GPIO                      (volatile uint8_t*) 0x50000000
#define NRF51_GPIO_OUT                  *(volatile uint32_t*) (NRF51_GPIO + 0x504)
#define NRF51_GPIO_OUTSET               *(volatile uint32_t*) (NRF51_GPIO + 0x508)
#define NRF51_GPIO_OUTCLR               *(volatile uint32_t*) (NRF51_GPIO + 0x50C)
#define NRF51_GPIO_IN                   *(volatile uint32_t*) (NRF51_GPIO + 0x510)
#define NRF51_GPIO_DIR                  *(volatile uint32_t*) (NRF51_GPIO + 0x514)
#define NRF51_GPIO_DIRSET               *(volatile uint32_t*) (NRF51_GPIO + 0x518)          // setting a bit to 1 sets the corresponding pin to output.
#define NRF51_GPIO_DIRCLR               *(volatile uint32_t*) (NRF51_GPIO + 0x518)          // setting a bit to 1 sets the corresponding pin to input.
#define NRF51_GPIO_DIR_OUTPUT(n)        NRF51_GPIO_DIRSET = 1 << n
#define NRF51_GPIO_DIR_INPUT(n)         NRF51_GPIO_DIRCLR = 1 << n
#define NRF51_GPIO_PIN_CNF(n)           *(volatile uint32_t*) (NRF51_GPIO + 0x700 + (n*4))
#define NRF51_GPIO_PIN_CNF_INPUT            ~1
#define NRF51_GPIO_PIN_CNF_OUTPUT            1
#define NRF51_GPIO_PIN_CNF_INPUT_CONNECT    ~0b00
#define NRF51_GPIO_PIN_CNF_INPUT_DISCONNECT  0b10
#define NRF51_GPIO_PIN_CNF_PULL_DISABLED    ~0b1100
#define NRF51_GPIO_PIN_CNF_PULL_PULLDOWN    0b0100
#define NRF51_GPIO_PIN_CNF_PULL_PULLUP      0b1000
#define NRF51_GPIO_PIN_CNF_DRIVE_S0S1       0b100000000
#define NRF51_GPIO_PIN_CNF_SENSE_HIGH        1<<16                                            // Pin sensing mechanism: Sense for high level
#define NRF51_GPIO_PIN_CNF_SENSE_LOW         1<<17                                            // Pin sensing mechanism: Sense for low level



////////////////////////////////////////////////////////////////////////////////////////////////////
/// GPIO TASKS AND EVENTS //////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////

// TASKS
#define NRF51_GPIOTE                    (volatile uint8_t*) 0x40006000
#define NRF51_GPIOTE_IRQn               6
#define NRF51_GPIOTE_OUT_N(n)           *(volatile uint32_t*) (NRF51_GPIOTE + 0x000 + (n*4))  // Task for writing to pin specified by PSEL in CONFIG[n].
#define NRF51_GPIOTE_OUT_0              *(volatile uint32_t*) (NRF51_GPIOTE + 0x000)          // Task for writing to pin specified by PSEL in CONFIG[0].
#define NRF51_GPIOTE_OUT_1              *(volatile uint32_t*) (NRF51_GPIOTE + 0x004)          // Task for writing to pin specified by PSEL in CONFIG[1].
#define NRF51_GPIOTE_OUT_2              *(volatile uint32_t*) (NRF51_GPIOTE + 0x008)          // Task for writing to pin specified by PSEL in CONFIG[2].
#define NRF51_GPIOTE_OUT_3              *(volatile uint32_t*) (NRF51_GPIOTE + 0x00C)          // Task for writing to pin specified by PSEL in CONFIG[3].
// EVENTS
#define NRF51_GPIOTE_IN_N(n)            *(volatile uint32_t*) (NRF51_GPIOTE + 0x100 + (n*4))  // Event generated from pin specified by PSEL in CONFIG[n].
#define NRF51_GPIOTE_IN_0               *(volatile uint32_t*) (NRF51_GPIOTE + 0x100)          // Event generated from pin specified by PSEL in CONFIG[0].
#define NRF51_GPIOTE_IN_1               *(volatile uint32_t*) (NRF51_GPIOTE + 0x104)          // Event generated from pin specified by PSEL in CONFIG[1].
#define NRF51_GPIOTE_IN_2               *(volatile uint32_t*) (NRF51_GPIOTE + 0x108)          // Event generated from pin specified by PSEL in CONFIG[2].
#define NRF51_GPIOTE_IN_3               *(volatile uint32_t*) (NRF51_GPIOTE + 0x10C)          // Event generated from pin specified by PSEL in CONFIG[3].
#define NRF51_GPIOTE_PORT               *(volatile uint32_t*) (NRF51_GPIOTE + 0x17C)          // Event generate from multiple input pins.
// REGISTERS
#define NRF51_GPIOTE_INTENSET           *(volatile uint32_t*) (NRF51_GPIOTE + 0x304)          // Interrupt enable set register.
#define NRF51_GPIOTE_INTENCLR           *(volatile uint32_t*) (NRF51_GPIOTE + 0x308)          // Interrupt enable clear register.
#define NRF51_GPIOTE_CONFIG_N(n)        *(volatile uint32_t*) (NRF51_GPIOTE + 0x510 + (n*4))  // Configuration for OUT[n] task and IN[n] event.
#define NRF51_GPIOTE_CONFIG_0           *(volatile uint32_t*) (NRF51_GPIOTE + 0x510)          // Configuration for OUT[0] task and IN[0] event.
#define NRF51_GPIOTE_CONFIG_1           *(volatile uint32_t*) (NRF51_GPIOTE + 0x514)          // Configuration for OUT[1] task and IN[1] event.
#define NRF51_GPIOTE_CONFIG_2           *(volatile uint32_t*) (NRF51_GPIOTE + 0x518)          // Configuration for OUT[2] task and IN[2] event.
#define NRF51_GPIOTE_CONFIG_3           *(volatile uint32_t*) (NRF51_GPIOTE + 0x51C)          // Configuration for OUT[3] task and IN[3] event.


#define NRF51_GPIOTE_CONFIG_MODE_DISABLED     0                                               // Disabled. Pin specified by PSEL will not be acquired by the GPIOTE module.
#define NRF51_GPIOTE_CONFIG_MODE_EVENT        1                                               // Event mode. The pin specified by PSEL will be configured as an input and the IN[n] event will be generated if operation specified in POLARITY occurs on the pin.
#define NRF51_GPIOTE_CONFIG_MODE_TASK         3                                               // Task mode. The pin specified by PSEL will be configured as an output and triggering the OUT[n] task will perform the operation specified by POLARITY on the pin. When enabled as a task the GPIOTE module will acquire the pin and the pin can no longer be written as a regular output pin from the GPIO module.
#define NRF51_GPIOTE_CONFIG_PSEL(pin)         (pin << 8)                                      // Pin number associated with OUT[n] task and IN[n] event.
#define NRF51_GPIOTE_CONFIG_PSEL_NONE         (31 << 8)                                       // Disabled (pin 31)
#define NRF51_GPIOTE_CONFIG_POLARITY_LOTOHI   (1 << 16)                                       // Task mode: Set pin from OUT[n] task.  Event mode: Generate IN[n] event when rising edge on pin.
#define NRF51_GPIOTE_CONFIG_POLARITY_HITOLO   (2 << 16)                                       // Task mode: Clear pin from OUT[n] task.  Event mode: Generate IN[n] event when falling edge on pin.
#define NRF51_GPIOTE_CONFIG_POLARITY_TOGGLE   (3 << 16)                                       // Task mode: Toggle pin from OUT[n].  Event mode: Generate IN[n] when any change on pin.
#define NRF51_GPIOTE_CONFIG_OUTINIT_LOW       (~(1 << 20))                                    // Task mode: Initial value of pin before task triggering is low.
#define NRF51_GPIOTE_CONFIG_OUTINIT_HIGH      (1 << 20)                                       // Task mode: Initial value of pin before task triggering is high.



////////////////////////////////////////////////////////////////////////////////////////////////////
/// GPIO TASKS AND EVENTS //////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////


// Note: when softdevice is enabled, only PPI channels <= 7 are available to the application
// Also: when softdevice is enabled, use the softdevice functions

#define NRF51_PPI                       (volatile uint8_t*)0x4001F000
//TASKS
#define NRF51_PPI_CHG_EN_N(n)           *(volatile uint32_t*) (NRF51_PPI + 0x000 + (n*8))     // Enable channel group N
#define NRF51_PPI_CHG_DIS_N(n)          *(volatile uint32_t*) (NRF51_PPI + 0x004 + (n*8))     // Disable channel group 0
//REGISTERS
#define NRF51_PPI_CHEN                  *(volatile uint32_t*) (NRF51_PPI + 0x500)             // Channel enable
#define NRF51_PPI_CHENSET               *(volatile uint32_t*) (NRF51_PPI + 0x504)             // Channel enable set
#define NRF51_PPI_CHENCLR               *(volatile uint32_t*) (NRF51_PPI + 0x508)             // Channel enable clear
#define NRF51_PPI_CH_EEP(n)             *(volatile uint32_t*) (NRF51_PPI + 0x510 + (n*8))     // Channel 0 event end-point
#define NRF51_PPI_CH_TEP(n)             *(volatile uint32_t*) (NRF51_PPI + 0x514 + (n*8))     // Channel 0 task end-point

////////////////////////////////////////////////////////////////////////////////////////////////////
/// UART ///////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////

