crownstone/bluenet/include/cs_nRF51822.h
#define NRF51_UART                     (volatile uint8_t*) 0x40002000

// TASKS
#define NRF51_UART_STARTRX             *(volatile uint32_t*) (NRF51_UART + 0x000)             //Start UART receiver
#define NRF51_UART_STOPRX              *(volatile uint32_t*) (NRF51_UART + 0x004)             //Stop UART receiver
#define NRF51_UART_STARTTX             *(volatile uint32_t*) (NRF51_UART + 0x008)             //Start UART transmitter
#define NRF51_UART_STOPTX              *(volatile uint32_t*) (NRF51_UART + 0x00C)             //Stop UART transmitter
// EVENTS
#define NRF51_UART_RXDRDY              *(volatile uint32_t*) (NRF51_UART + 0x108)             //Data received in RXD
#define NRF51_UART_TXDRDY              *(volatile uint32_t*) (NRF51_UART + 0x11C)             //Data sent from TXD
#define NRF51_UART_ERROR               *(volatile uint32_t*) (NRF51_UART + 0x124)             //Error detected
// REGISTERS
#define NRF51_UART_INTENSET            *(volatile uint32_t*) (NRF51_UART + 0x304)             //Interrupt enable set register
#define NRF51_UART_INTENCLR            *(volatile uint32_t*) (NRF51_UART + 0x308)             //Interrupt enable clear register
#define NRF51_UART_ERRORSRC            *(volatile uint32_t*) (NRF51_UART + 0x480)             //Error source
#define NRF51_UART_ENABLE              *(volatile uint32_t*) (NRF51_UART + 0x500)             //Enable and acquire IOs
#define NRF51_UART_PSELRTS             *(volatile uint32_t*) (NRF51_UART + 0x508)             //Pin select for RTS
#define NRF51_UART_PSELTXD             *(volatile uint32_t*) (NRF51_UART + 0x50C)             //Pin select for TXD
#define NRF51_UART_PSELCTS             *(volatile uint32_t*) (NRF51_UART + 0x510)             //Pin select for CTS
#define NRF51_UART_PSELRXD             *(volatile uint32_t*) (NRF51_UART + 0x514)             //Pin select for RXD
#define NRF51_UART_RXD                 *(volatile uint32_t*) (NRF51_UART + 0x518)             //RXD register
#define NRF51_UART_TXD                 *(volatile uint32_t*) (NRF51_UART + 0x51C)             //TXD register
#define NRF51_UART_BAUDRATE            *(volatile uint32_t*) (NRF51_UART + 0x524)             //Baud rate
#define NRF51_UART_CONFIG              *(volatile uint32_t*) (NRF51_UART + 0x56C)             //Configuration of parity and hardware flow control

#define NRF51_UART_CONFIG_HWFC_ENABLED 1   // Hardware flow control enabled
#define NRF51_UART_CONFIG_PARITY_EXCLUDE ~0b10   // Exclude parity bit
#define NRF51_UART_CONFIG_PARITY_INCLUDE 2 // Include parity bit
// C RW RXPARITY Configuration of parity bit used in reception
// MANUAL 0 9th bit received is saved in RXPARITY register
// AUTO 1 9th bit received is compared to a parity generated from the 8 first bits
// D RW TXPARITY Configuration of parity used in transmission
// MANUAL 0 9th bit transmitted is taken from the TXPARITY register
// AUTO 1 9th bit transmitted is parity bit generated from the 8 first bits


////////////////////////////////////////////////////////////////////////////////////////////////////
/// SPI ///////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////////////////////////


#define NRF51_SPI_N(n)                 0x40003000+(0x1000*n)
// EVENTS
#define NRF51_SPI_READY(n)             *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x108)         //TXD byte sent and RXD byte received
// REGISTERS
#define NRF51_SPI_INTENSET(n)          *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x304)         //Interrupt enable set register
#define NRF51_SPI_INTENCLR(n)          *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x308)         //Interrupt enable clear register
#define NRF51_SPI_ENABLE(n)            *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x500)         //Enable SPI
#define NRF51_SPI_PSELSCK(n)           *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x508)         //Pin select for SCK
#define NRF51_SPI_PSELMOSI(n)          *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x50C)         //Pin select for MOSI
#define NRF51_SPI_PSELMISO(n)          *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x510)         //Pin select for MISO
#define NRF51_SPI_RXD(n)               *(volatile uint8_t*)  (NRF51_SPI_N(n) + 0x518)         //RXD register
#define NRF51_SPI_TXD(n)               *(volatile uint8_t*)  (NRF51_SPI_N(n) + 0x51C)         //TXD register
#define NRF51_SPI_FREQUENCY(n)         *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x524)         //SPI frequency


#define NRF51_SPI_FREQUENCY_125_K      0x02000000    // 125 kbps
#define NRF51_SPI_FREQUENCY_250K       0x04000000    // 250 kbps
#define NRF51_SPI_FREQUENCY_500K       0x08000000    // 500 kbps
#define NRF51_SPI_FREQUENCY_1M         0x10000000    // 1 Mbps
#define NRF51_SPI_FREQUENCY_2M         0x20000000    // 2 Mbps
#define NRF51_SPI_FREQUENCY_4M         0x40000000    // 4 Mbps
#define NRF51_SPI_FREQUENCY_8M         0x80000000    // 8 Mbps

#define NRF51_SPI_CONFIG(n)            *(volatile uint32_t*) (NRF51_SPI_N(n) + 0x554)         //Configuration register
#define NRF51_SPI_CONFIG_MSBFIRST      ~1
#define NRF51_SPI_CONFIG_LSBFIRST      2
#define NRF51_SPI_CONFIG_ACTIVE_HIGH   ~2
#define NRF51_SPI_CONFIG_ACTIVE_LOW    2
#define NRF51_SPI_CONFIG_CPHA_LEADING  ~4
#define NRF51_SPI_CONFIG_CPHA_TRAILING 4


// ARMV v6 ARM Table B3-18 NVIC register summary
#define NRF51_NVIC_ISER                *(volatile uint32_t*)0xE000E100                        // Interrupt Set-Enable Register.
#define NRF51_NVIC_ICER                *(volatile uint32_t*)0xE000E180                        // Interrupt Clear-Enable Register
#define NRF51_NVIC_ISPR                *(volatile uint32_t*)0xE000E200                        // Interrupt Set-Pending Register
#define NRF51_NVIC_ICPR                *(volatile uint32_t*)0xE000E280                        // Interrupt Clear-Pending Register
#define NRF51_NVIC_IPRn(n)             *(volatile uint32_t*)(0xE000E400+(4*n))                // Interrupt Priority Registers


#ifdef __cplusplus
}
#endif
